Revit 2027 API
MEPNetworkSegmentData.Coefficient Property
 The calculated coefficient of this segment, dimensionless.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Coefficient { get; }
Public ReadOnly Property Coefficient As Double
	Get
public:
property double Coefficient {
	double get ();
}
member Coefficient : float with get
Property Value
Double
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace